### Описание проекта

Проект включает разработку веб-сайта для заказа цветов и улучшенного Telegram бота для приема заказов.

### **Основные функции**

**Регистрация и авторизация пользователей**

Пользователи могут легко зарегистрироваться на сайте и создать личный аккаунт

**Просмотр каталога цветов**

Пользователи могут просматривать каталог, узнавать о наличии цветов и добавлять выбранные позиции в корзину для дальнейшего оформления заказа.

**Оформление заказа через корзину**

После выбора товаров из каталога пользователи могут перейти в корзину для оформления заказа. Процесс заказа интуитивно понятен и включает все необходимые этапы для завершения покупки.

**Просмотр истории заказов**

Каждый пользователь имеет доступ к своей истории заказов на отдельной странице. И через неё может отслеживать статусы своих заказов.

**Управление статусами заказов через панель администратора**

Администраторы сайта имеют возможность управлять заказами, изменять их статусы и следить за выполнением.

**Подключение Telegram-бота**

Проект интегрирован с Telegram-ботом, который уведомляет магазин о новых заказах и предоставляет дополнительную информацию.
